numbers = {0: 'тэг', 1: 'нэг', 2: 'хоёр', 
3:'гурав', 4: 'дөрөв', 5: 'тав', 6:'зургаа',
7:'долоо', 8: 'найм', 9: 'ес', 10: 'арав', 
20: 'хорь', 30: 'гуч', 40: 'дөч', 50: 'тавь',
60: 'жар', 70: 'дал', 80: 'ная', 90: 'ер'}
numbers2 = {1: 'нэг', 2: 'хоёр', 
3:'гурван', 4: 'дөрвөн', 5: 'таван', 6:'зургаан',
7:'долоон', 8: 'найман', 9: 'есөн',
10: 'арван ', 20: 'хорин ', 30: 'гучин ', 
40: 'дөчин ', 50: 'тавин ', 60: 'жаран ',
70: 'далан ', 80: 'наян ', 90: 'ерэн '}

n = int(input("Enter value: "))
if n <= 10:
    text = numbers[n]
elif n < 100:
    if n % 10 == 0:
        text = numbers[n]
    else:
        k = n // 10 * 10
        r = n % 10
        text = numbers2[k] + ' ' + numbers[r]
elif n < 1000:
    if n % 100 == 0:
        h = n / 100
        text = numbers2[h] + ' зуу'
    else:
        if n % 10 == 0:
             h = n // 100
             k = n % 100
             text = numbers2[h] + ' зуун ' + numbers[k]
        else:
            h = n // 100
            k = n % 100 // 10 * 10
            r = n % 10
            if k == 0:
                text = numbers2[h] + ' зуун ' + numbers[r]
            else:
                text = numbers2[h] + ' зуун ' + numbers2[k] + numbers[r]
print(text)