# 3.	n оронтой натурал тооны хувьд уг тооны цифрүүдийг n зэрэгт дэвшүүлэн 
# нэмэхэд тоо өөрөө гарч байвал түүнийг Армстронгийн тоо гэдэг. 
# Тэгвэл 3 ба 4 оронтой Армстронгийн бүх тоог ол. Жишээ нь 153 = 1^3 + 5^3 + 3^3 
# учир Армстронгийн тоо болно.

def armstrong(n):
    s = 0
    a = n
    while n > 0:
        r = n % 10
        if a < 1000:
            s += r**3
        else: 
            s += r**4 
        n //= 10
        if a == s:
            return True
    
for i in range(100, 10000):
    if armstrong(i):
        print(i, end=' ')